# SetUpFromBottom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..SetUpFromBottom Property
PipeSettings Class See Also
---
The abbreviation of the Set Up from bottom of fitting(SUB) string.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public string SetUpFromBottom { get; set; }
```

Visual Basic
---
```text
Public Property SetUpFromBottom As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SetUpFromBottom {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace